#pragma once

//Типы: char, int, short, long, long long

//ТИП         РАЗМЕР        МАКСИМАЛЬНОЕ ЗНАЧЕНИЕ          МИНИМАЛЬНОЕ ЗНАЧЕНИЕ
//char          1                 127                             - 128
//int           4               2147483647                     - 2147483648
//short         2                32767                           - 32768
//long          4               2147483647                     - 2147483648
//long long     8         9223372036854775807              - 9223372036854775808